src/OpenFOAM/OpenFOAM-7/tutorials/combustion/reactingFoam/RAS/SandiaD_LTS/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    wallTube
    {
        type            zeroGradient;
    }

    outlet
    {
        type            totalPressure;
        p0              $internalField;
    }

    inletPilot
    {
        type            zeroGradient;
    }

    inletAir
    {
        type            zeroGradient;
    }

    wallOutside
    {
        type            zeroGradient;
    }

    inletCH4
    {
        type            zeroGradient;
    }

    frontAndBack_pos
    {
        type            wedge;
    }

    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
